stockem/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = ? ORDER BY "users"."id" ASC LIMIT ?  [["name", "Paul Taele"], ["LIMIT", 1]]
---
  def index
    @users = User.where(name: "Paul Taele")