stockem/app/controllers/user_profiles_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = ?  [["name", "Paul Taele"]]
---
  def index
    @user_profile = User.where(name: "Paul Taele")