app/views/user_profiles/_user_profile.html.erb

      <strong>Name:</strong>
      <span class="user-value"><%= user_profile.first_name + " " + user_profile.last_name %></span>
---
SELECT "users".* FROM "users" WHERE "users"."name" = ?  [["name", "Paul Taele"]]