app/views/items/show.html.erb

        <%= button_to 'Back', items_path, method: :get, class: 'btn', form: { class: 'back-button-form'}, id:'back_button' %>
          <% if User.find(session[:user_id]).auth_level == 2 %>
---
SELECT "users".* FROM "users" WHERE "users"."user_id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["user_id", "4"], ["LIMIT", 1]]