app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."item_id" = ? ORDER BY created_at DESC  [["item_id", 1]]
---
  def show
    @item = Item.find(params[:id])
	@writing_note = ! params[:writing_note].nil?
	@notes = Note.where(item_id: @item.id).order('created_at DESC')

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."item_id" = ? ORDER BY created_at DESC  [["item_id", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "notes" ("note_id", "item_id", "msg", "user_id", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["note_id", ""], ["item_id", 1], ["msg", "hello"], ["user_id", 4], ["image", nil], ["created_at", "2024-10-17 17:52:47.804934"], ["updated_at", "2024-10-17 17:52:47.804958"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def add_note
    @item = Item.find(params[:id])
    Note.create!({ note_id: '', item: @item, msg: params[:note_msg], user: User.find_by(id: session[:user_id]), created_at: DateTime.now, updated_at: DateTime.now})