app/controllers/items_controller.rb

SELECT "notes".* FROM "notes" LEFT OUTER JOIN "users" ON "users"."id" = "notes"."user_id" WHERE "notes"."item_id" = ? ORDER BY created_at DESC  [["item_id", 1]]
---
  def set_status # rubocop:disable Metrics/AbcSize,Metrics/MethodLength
    @item = Item.find(params[:id])
    @notes = Note.where(item_id: @item.id).order('created_at DESC')

    if current_user.auth_level.zero?
      flash[:alert] = 'You need to be an admin or assistant to update the status of this item.'
      redirect_to item_path(@item) and return
    end

    valid_statuses = [nil, 'Damaged', 'Lost', 'Not Available', 'Intact']
    status = get_valid_status(item_params[:status])

    if valid_statuses.include?(status) && @item.update(item_params)