app/controllers/sessions_controller.rb

INSERT INTO "users" ("user_id", "name", "uin", "email", "contact_no", "role", "details", "auth_level", "created_at", "updated_at", "provider", "first_name", "last_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."user_id" IS NULL AND "users"."provider" = ? LIMIT ?  [["provider", "google_oauth2"], ["LIMIT", 1]]
---
  def omniauth
    auth = request.env['omniauth.auth']
    @user = User.find_or_create_by(user_id: auth['user_id'], provider: auth['provider']) do |u|