app/controllers/user_profiles_controller.rb

  def set_user_profile
    @user_profile = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]