app/controllers/users_controller.rb

  def show
    @current_user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @current_user = User.find(params[:id])

    respond_to do |format|
      if @current_user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "uin" = ?, "contact_no" = ?, "details" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["uin", ""], ["contact_no", ""], ["details", "chillin tbh"], ["updated_at", "2024-10-17 06:20:14.315500"], ["id", 4]]